Improve README developer documentation
